[
  {
    "id": "recipe_20241124_011944",
    "content": "Title: Chunar\nChinese Name: 烤羊肉串\nEnglish Name: Chunar\nCuisine Type: 新疆菜\n\nChunar is a city located in Mirzapur district of Indian state of Uttar Pradesh. It is nearby Mirzapur city. The railway tracks passing through Chunar Junction railway station leads to major destinations of India, including Howrah, Delhi, Tatanagar and Varanasi. National Highway 35 (old NH7) also passes through Chunar. It is connected to the city of Mirzapur and Varanasi by roads and rails. Chunar is well known for its handicraft products made from clay and plaster of paris. It is also famous for its historical place - Chunar Fort.",
    "metadata": {
      "cuisine_type": "新疆菜",
      "dish_name": "烤羊肉串",
      "english_name": "Chunar",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Chunar",
      "timestamp": "2024-11-24T01:19:44.420786"
    }
  },
  {
    "id": "recipe_20241124_011946",
    "content": "Title: Naan\nChinese Name: 馕\nEnglish Name: Nang bread\nCuisine Type: 新疆菜\n\nNaan () is a leavened, oven-baked or tawa-fried flatbread, that can also be baked in a tandoor. It is characterized by a light and fluffy texture and golden-brown spots from the baking process. Naan is found in the cuisines of Central Asia, South Asia, Southeast Asia, and the Caribbean. Composed of white or wheat flour and combined with a leavening agent, typically yeast, naan dough develops air pockets that contribute to its fluffy and soft texture. Additional ingredients for crafting naan include warm water, salt, ghee and yogurt, with optional additions like milk, egg, or honey. Baking powder or baking soda can be used instead of yeast to reduce the preparation time for the bread. In the baking process using a tandoor, naan dough is rolled into balls, flattened and pressed against the inner walls, which can reach temperatures up to 480 °C (900 °F). This method allows the bread to be baked within minutes, achieving a spotty browning due to intense heat. Naan can be prepared on a stovetop using a tava. The pan may be flipped upside down over the flame to achieve browning on the bread's surface. Once baked, naan is coated with ghee or butter and served warm. This soft and pliable bread accompanies meals, replacing utensils for scooping up sauces, stews, and curries, or with dryer dishes like tandoori chicken.",
    "metadata": {
      "cuisine_type": "新疆菜",
      "dish_name": "馕",
      "english_name": "Nang bread",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Naan",
      "timestamp": "2024-11-24T01:19:46.157321"
    }
  },
  {
    "id": "recipe_20241124_011947",
    "content": "Title: Uyghur cuisine\nChinese Name: 羊肉抓饭\nEnglish Name: Uyghur polo\nCuisine Type: 新疆菜\n\nUyghur cuisine (Uyghur: ئۇيغۇر تائاملىرى, romanized: uyghur taamliri, уйғур таамлири; Chinese: 維吾爾菜; pinyin: wéiwú'ěr cài) is the cuisine of the Uyghur people, which are mainly situated in the autonomous region of Xinjiang. The cuisine is characterized by ingredients like roasted mutton and beef, as well as kebab and rice dishes. Traditionally, specific dishes like polo are eaten with one's bare hands instead of with utensils like spoons, forks or chopsticks. Signature dishes include polo, läghmän and nan. Because the majority of Uyghur people are Muslim, the food is predominantly halal.",
    "metadata": {
      "cuisine_type": "新疆菜",
      "dish_name": "羊肉抓饭",
      "english_name": "Uyghur polo",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Uyghur_cuisine",
      "timestamp": "2024-11-24T01:19:47.909564"
    }
  },
  {
    "id": "recipe_20241124_011950",
    "content": "Title: Oil noodles\nChinese Name: 过油肉拌面\nEnglish Name: Oil-mixed noodles with meat\nCuisine Type: 新疆菜\n\nOil noodles or cooked noodles is a type of Chinese noodle. It is sometimes used in Cantonese cuisine.",
    "metadata": {
      "cuisine_type": "新疆菜",
      "dish_name": "过油肉拌面",
      "english_name": "Oil-mixed noodles with meat",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Oil_noodles",
      "timestamp": "2024-11-24T01:19:50.207563"
    }
  },
  {
    "id": "recipe_20241124_011952",
    "content": "Title: Ramen\nChinese Name: 菠菜面\nEnglish Name: Spinach noodles\nCuisine Type: 新疆菜\n\nRamen () (拉麺, ラーメン or らあめん, rāmen, [ɾaꜜːmeɴ] ) is a Japanese noodle dish. It includes Chinese-style wheat noodles (中華麺, chūkamen) served in a broth. Common flavors are soy sauce and miso, with typical toppings including sliced pork (chāshū), nori (dried seaweed), menma (bamboo shoots), and scallions. Ramen has its roots in Chinese noodle dishes and is a part of Japanese Chinese cuisine. Nearly every region in Japan has its own variation of ramen, such as the tonkotsu (pork bone broth) ramen of Kyushu and the miso ramen of Hokkaido. The origins of ramen can be traced back to Yokohama Chinatown in the early 20th century. The word \"ramen\" is a Japanese borrowing of the Chinese word lamian (拉麵), meaning \"pulled noodles\", but is not derived from the northern Chinese dish of lamian. Instead, the dish evolved from southern Chinese noodle dishes from regions such as Guangzhou, reflecting the demographics of Chinese settlers in Yokohama. Ramen gained popularity in Japan, especially during food shortages following World War II. In 1958, instant noodles were invented by Momofuku Ando, further popularizing the dish. Today, ramen is a cultural icon in Japan, with many regional varieties and a wide range of toppings. Examples include Sapporo's rich miso ramen, Hakodate's salt-flavored ramen, Kitakata's thick, flat noodles in pork-and-niboshi broth, Tokyo-style ramen with soy-flavored chicken broth, Yokohama's Iekei Ramen with soy flavored pork broth, Wakayama's soy sauce and pork bone broth, and Hakata's milky tonkotsu (pork bone) broth. Ramen is offered in various establishments and locations, with the best quality usually found in specialist ramen shops called ramenya (ラーメン屋). Ramen's popularity has spread outside of Japan. In Korea, ramen is also known as its original name (라멘), having their own variation of the dish, ramyeon (라면). In China, ramen is called rìshì lāmiàn (日式拉面/日式拉麵 \"Japanese-style lamian\"). Ramen has also made its way into Western restaurant chains. Instant ramen was exported from Japan in 1971 and has since gained international recognition.",
    "metadata": {
      "cuisine_type": "新疆菜",
      "dish_name": "菠菜面",
      "english_name": "Spinach noodles",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Ramen",
      "timestamp": "2024-11-24T01:19:52.965454"
    }
  },
  {
    "id": "recipe_20241124_011954",
    "content": "Title: Laghman (food)\nChinese Name: 拉条子\nEnglish Name: Latiaozi\nCuisine Type: 新疆菜\n\nLaghman (Uyghur: لەغمەن, leghmen, ләғмән; Kazakh: лағман, lağman; Uzbek: lagʻmon; Tajik: лағмон, lağmon; Kyrgyz: лагман, lagman) is a dish of meat, vegetables and pulled noodles from Uyghur cuisine and Central Asian cuisine. In Chinese, the noodle is known as latiaozi (Chinese: 拉条子) or bànmiàn (Chinese: 拌面). As native Turkic words do not begin with the letter 'L', läghmän is a loanword from the Chinese lamian and appears to be an adaptation of Northern Chinese noodle dishes, although its taste and preparation are distinctly Uyghur. It is also a traditional dish of the Hui or Dungan people who call the dish bànmiàn. It is especially popular in Kazakhstan and Kyrgyzstan, where it is considered a national dish of the local Uyghur and Dungan (Hui) ethnic minorities. It is also popular in Russia, Uzbekistan, Tajikistan, Turkmenistan and Northeastern Afghanistan, where chickpeas are added to it and parts of Northern Pakistan. The Crimean Tatar cuisine also adopted lagman from the Uzbek culture.",
    "metadata": {
      "cuisine_type": "新疆菜",
      "dish_name": "拉条子",
      "english_name": "Latiaozi",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Laghman_(food)",
      "timestamp": "2024-11-24T01:19:54.440369"
    }
  },
  {
    "id": "recipe_20241124_011955",
    "content": "Title: Dapanji\nChinese Name: 大盘鸡\nEnglish Name: Dapanji\nCuisine Type: 新疆菜\n\nDapanji (Uyghur: تۇخۇ قوردىقى, romanized: toxu qordiqi; Chinese: 大盘鸡; pinyin: Dàpánjī; lit. 'big plate chicken') is a spicy chicken stew that was invented by a Han Chinese chef in Shawan, Xinjiang in the 1980s. Although originally considered as Chinese cuisine rather than Uyghur, the chef made the dish halal to accommodate local religious customs and quickly struck its popularity amongst local Uyghur population.",
    "metadata": {
      "cuisine_type": "新疆菜",
      "dish_name": "大盘鸡",
      "english_name": "Dapanji",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Dapanji",
      "timestamp": "2024-11-24T01:19:55.917380"
    }
  },
  {
    "id": "recipe_20241124_011958",
    "content": "Title: Fried noodles\nChinese Name: 干煸炒面\nEnglish Name: Dry-fried noodles\nCuisine Type: 新疆菜\n\nFried noodles are common throughout East Asia, Southeast Asia and South Asia. Many varieties, cooking styles, and ingredients exist.",
    "metadata": {
      "cuisine_type": "新疆菜",
      "dish_name": "干煸炒面",
      "english_name": "Dry-fried noodles",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Fried_noodles",
      "timestamp": "2024-11-24T01:19:58.235942"
    }
  },
  {
    "id": "recipe_20241124_011959",
    "content": "Title: Oracle bone\nChinese Name: 新疆架子肉\nEnglish Name: Jiazi meat\nCuisine Type: 新疆菜\n\nOracle bones are pieces of ox scapula and turtle plastron which were used in pyromancy – a form of divination – during the Late Shang period (c. 1250 – c. 1050 BCE) in ancient China. Scapulimancy is the specific term if ox scapulae were used for the divination, plastromancy if turtle plastrons were used. A recent count estimated that there were about 13,000 bones with a total of a little over 130,000 inscriptions in collections in China and some fourteen other countries. Diviners would submit questions to deities regarding weather, crop planting, the fortunes of members of the royal family, military endeavors, and similar topics. These questions were carved onto the bone or shell in oracle bone script using a sharp tool. Intense heat was then applied with a metal rod until the bone or shell cracked due to thermal expansion. The diviner would then interpret the pattern of cracks and write the prognostication upon the piece as well. Pyromancy with bones continued in China into the Zhou dynasty, but the questions and prognostications were increasingly written with brushes and cinnabar ink, which degraded over time. Oracle bones bear the earliest known significant corpus of ancient Chinese writing, using an early form of Chinese characters. The inscriptions contain around 5,000 different characters, many of which are still being used today, though the total number of discrete characters is uncertain as some may be different versions of the same character. Specialists have agreed on the form, meanings, and sound of a little more than a quarter of the characters, roughly 1,200 with certainty, but several hundred more remain under discussion; these known characters comprise much of the core vocabulary of modern Chinese. They provide important information on the late Shang period, and scholars have reconstructed the Shang royal genealogy from the cycle of ancestral sacrifices recorded on oracle bones. When they were discovered at the end of the nineteenth century and deciphered in the early twentieth century, these records confirmed the existence of the Shang, whose historicity had been subject to scrutiny at the time by the Doubting Antiquity School. Oraculology is the discipline for the study of oracle bones and the oracle bone script.",
    "metadata": {
      "cuisine_type": "新疆菜",
      "dish_name": "新疆架子肉",
      "english_name": "Jiazi meat",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Oracle_bone",
      "timestamp": "2024-11-24T01:19:59.946734"
    }
  },
  {
    "id": "recipe_20241124_012002",
    "content": "Title: Cellophane noodles\nChinese Name: 丁丁炒面\nEnglish Name: Chopped noodles\nCuisine Type: 新疆菜\n\nCellophane noodles, or fensi (traditional Chinese: 粉絲; simplified Chinese: 粉丝; pinyin: fěnsī; lit. 'flour thread'), sometimes called glass noodles, are a type of transparent noodle made from starch (such as mung bean starch, potato starch, sweet potato starch, tapioca, or canna starch) and water. A stabilizer such as chitosan (or alum, illegal in some jurisdictions) may also be used. They are generally sold in dried form, soaked to reconstitute, then used in soups, stir-fried dishes, or spring rolls. They are called \"cellophane noodles\" or \"glass noodles\" because of their cellophane- or glass-like transparency when cooked. Cellophane noodles should not be confused with rice vermicelli, which are made from rice and are white in color rather than clear (after cooking in water).",
    "metadata": {
      "cuisine_type": "新疆菜",
      "dish_name": "丁丁炒面",
      "english_name": "Chopped noodles",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Cellophane_noodles",
      "timestamp": "2024-11-24T01:20:02.323966"
    }
  },
  {
    "id": "recipe_20241124_012004",
    "content": "Title: Laziji\nChinese Name: 辣子鸡丁\nEnglish Name: Laziji\nCuisine Type: 川菜（四川，重庆）\n\nLaziji (simplified Chinese: 辣子鸡; traditional Chinese: 辣子雞; pinyin: làzijī; lit. 'spicy chicken'), also known as dry chili chicken, firecracker chicken, Chongqing chicken, and mala chicken, is a dish of chicken cubes stir-fried in chilis, Szechuan pepper, spicy fermented bean paste, garlic, and ginger. Toasted sesame seeds and sliced spring onions are often used to garnish the dish. Laziji originated near Geleshan in Chongqing, where restaurateurs used small free-range chickens from nearby farms. This poultry became a signature export for Geleshan.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "辣子鸡丁",
      "english_name": "Laziji",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Laziji",
      "timestamp": "2024-11-24T01:20:04.565705"
    }
  },
  {
    "id": "recipe_20241124_012006",
    "content": "Title: Pepper steak\nChinese Name: 青椒肉丝\nEnglish Name: Qingjiao rousi\nCuisine Type: 川菜（四川，重庆）\n\nPepper steak (Chinese: 青椒牛肉; pinyin: qīngjiāoniúròu) is a stir-fried Chinese dish consisting of sliced beef steak (often flank, sirloin, or round) cooked with sliced bell peppers, bamboo shoots and other seasonings such as soy sauce and ginger, and usually thickened with cornstarch. Sliced onions and bean sprouts are also frequent additions to the recipe. Evidence for the dish's existence in the United States dates from at least 1948. The dish originated from Fujian cuisine, where it was known as qīngjiāo ròusī (青椒炒肉絲). In the original dish the meat used was pork and the seasonings were relatively light compared to pepper steak.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "青椒肉丝",
      "english_name": "Qingjiao rousi",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Pepper_steak",
      "timestamp": "2024-11-24T01:20:06.094969"
    }
  },
  {
    "id": "recipe_20241124_012007",
    "content": "Title: Billy Beer\nChinese Name: 啤酒鸭\nEnglish Name: Beer duck\nCuisine Type: 川菜（四川，重庆）\n\nBilly Beer is a brand of beer first made in the United States in July 1977, by the Falls City Brewing Company. It was promoted by Billy Carter, whose older brother Jimmy was then the president of the United States. In October 1978, Falls City announced that it was closing after less than a year of Carter's promotion. The beer was produced by Cold Spring Brewing, West End Brewing, and Pearl Brewing Company. In 2018, Uptown Brewing Company and Billy Beer, Inc. entered into a partnership with Greene County, North Carolina to build a 10,000-square-foot (930 m2) production facility at the North West Greene Industrial Park.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "啤酒鸭",
      "english_name": "Beer duck",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Billy_Beer",
      "timestamp": "2024-11-24T01:20:07.624956"
    }
  },
  {
    "id": "recipe_20241124_012009",
    "content": "Title: Shuizhu\nChinese Name: 水煮肉片\nEnglish Name: Shuizhu beef\nCuisine Type: 川菜（四川，重庆）\n\nShuizhu (Chinese: 水煮; pinyin: shǔizhǔ, [ʂwěɪ ʈʂù ɻôʊ pʰjɛ̂n]) is a Chinese dish which originated from the cuisine of Sichuan province and the name literally means \"water boiled (meat)\". The preparation of this dish usually involves some sort of meat, usually beef, which is then called \"shǔizhǔròupiàn\" or fish when it's called \"shǔizhǔyú, 水煮鱼\", chili pepper, and a large amount of vegetable oil. The meat is prepared with water, starch, and a slight amount of salt. Boiled vegetables are placed at the bottom of the serving bowl or dish. The prepared raw meat is poached in water that is heated to boiling point for 20–30 seconds, just enough to remove rawness yet preserving the meat's tenderness. Then it is drained and put in the serving dish with vegetables. Minced dried chili, sichuan pepper, minced garlic, and other seasoning are spread over the meat. Vegetable oil is heated in a pan nearly to smoking point, then poured over the prepared meat and vegetable. This dish maintains tenderness of the meat by poaching it instead of stir frying. It offers a good combination of tender meat, freshness of vegetable, hot spicy flavor of chili pepper, and numbing sensation of Sichuan pepper.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "水煮肉片",
      "english_name": "Shuizhu beef",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Shuizhu",
      "timestamp": "2024-11-24T01:20:09.352836"
    }
  },
  {
    "id": "recipe_20241124_012010",
    "content": "Title: Hot pot\nChinese Name: 四川火锅\nEnglish Name: Sichuan hotpot\nCuisine Type: 川菜（四川，重庆）\n\nHot pot (simplified Chinese: 火锅; traditional Chinese: 火鍋; pinyin: huǒguō; lit. 'fire pot') or hotpot, also known as steamboat, is a dish of soup stock, kept simmering by a heat source on the table, accompanied by an array of raw meats and vegetables which diners dip and cook in the broth.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "四川火锅",
      "english_name": "Sichuan hotpot",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Hot_pot",
      "timestamp": "2024-11-24T01:20:10.835447"
    }
  },
  {
    "id": "recipe_20241124_012012",
    "content": "Title: Kung Pao chicken\nChinese Name: 宫保鸡丁\nEnglish Name: Kung Pao chicken\nCuisine Type: 川菜（四川，重庆）\n\nKung Pao chicken (Chinese: 宮保雞丁; pinyin: Gōngbǎo jīdīng; Wade–Giles: Kung1-pao3 chi1-ting1; Zhuyin Fuhao: ㄍㄨㄥ ㄅㄠˇ ㄐㄧ ㄉㄧㄥ), also transcribed Gong Bao or Kung Po, is a spicy, stir-fried Chinese dish made with cubes of cooked chicken, peanuts, vegetables and chili peppers, and Sichuan peppercorns. From its origins in Sichuan cuisine, the dish's popularity has spread throughout China, spawning a number of regional variations—some of which are less spicy than the classic version.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "宫保鸡丁",
      "english_name": "Kung Pao chicken",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Kung_Pao_chicken",
      "timestamp": "2024-11-24T01:20:12.369955"
    }
  },
  {
    "id": "recipe_20241124_012014",
    "content": "Title: Fish with pickled mustard greens\nChinese Name: 酸菜鱼\nEnglish Name: Fish with pickled mustard greens\nCuisine Type: 川菜（四川，重庆）\n\nSuanCai Yu (Chinese: 酸菜鱼), also known as sauerkraut fish or sichuan fish with pickled mustard greens, is a dish originating from Chongqing in Sichuan Province. Popularized in the 1990s, SuanCai Yu has become one of Sichuan's most renowned dishes, distinguished by its sour and spicy flavors.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "酸菜鱼",
      "english_name": "Fish with pickled mustard greens",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Fish_with_pickled_mustard_greens",
      "timestamp": "2024-11-24T01:20:14.153163"
    }
  },
  {
    "id": "recipe_20241124_012015",
    "content": "Title: Fried rice\nChinese Name: 辣椒炒肉\nEnglish Name: Stir-fried pork with chili\nCuisine Type: 川菜（四川，重庆）\n\nFried rice is a dish of cooked rice that has been stir-fried in a wok or a frying pan and is usually mixed with other ingredients such as eggs, vegetables, seafood, or meat. It is often eaten by itself or as an accompaniment to another dish. Fried rice is a popular component of East Asian, Southeast Asian and certain South Asian cuisines, as well as a staple national dish of Indonesia. As a homemade dish, fried rice is typically made with ingredients left over from other dishes, leading to countless variations. Fried rice first developed during the Sui dynasty in China. Many varieties of fried rice have their own specific list of ingredients. In China, common varieties include Yangzhou fried rice and Hokkien fried rice. Japanese chāhan is considered a Japanese Chinese dish, having derived from Chinese fried rice dishes. In Southeast Asia, similarly constructed Indonesian, Malaysian, and Singaporean nasi goreng and Thai khao phat and Pineapple fried rice are popular dishes.In the West, most restaurants catering to vegetarians have invented their own varieties of fried rice, including egg fried rice. Fried rice is also seen on the menus of non-Asian countries restaurants offering cuisines with no native tradition of the dish. Additionally, the cuisine of some Latin American countries includes variations on fried rice, including Ecuadorian chaulafan, Peruvian arroz chaufa, Cuban arroz frito, and Puerto Rican arroz mampostea(d)o. Fried rice is a common street food in Asia and other parts of the world. In some Asian countries, small restaurants, street vendors and traveling hawkers specialise in serving fried rice. In Indonesian cities it is common to find fried rice street vendors moving through the streets with their food cart and stationing it in busy streets or residential areas. Many Southeast Asian street food stands offer fried rice with a selection of optional garnishes and side dishes.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "辣椒炒肉",
      "english_name": "Stir-fried pork with chili",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Fried_rice",
      "timestamp": "2024-11-24T01:20:15.767404"
    }
  },
  {
    "id": "recipe_20241124_012017",
    "content": "Title: Malatang\nChinese Name: 麻辣烫\nEnglish Name: Malatang\nCuisine Type: 川菜（四川，重庆）\n\nMalatang (simplified Chinese: 麻辣烫; traditional Chinese: 麻辣燙; pinyin: málàtàng; lit. 'numb spicy hot') is a common type of Chinese street food. It originated in Sichuan, China, but it differs mainly from the Sichuanese version in that the Sichuanese version is more similar to what in northern China would be described as hot pot.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "麻辣烫",
      "english_name": "Malatang",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Malatang",
      "timestamp": "2024-11-24T01:20:17.306717"
    }
  },
  {
    "id": "recipe_20241124_012019",
    "content": "Title: Sichuan cuisine\nChinese Name: 毛血旺\nEnglish Name: Mao xue wang\nCuisine Type: 川菜（四川，重庆）\n\nSichuan cuisine or Sichuanese cuisine, alternatively romanized as Szechwan cuisine or Szechuan cuisine (Chinese: , Standard Mandarin pronunciation: [sɨ̂.ʈʂʰwán] ) is a style of Chinese cuisine originating from Sichuan province and the neighboring Chongqing municipality. Chongqing was formerly a part of Sichuan until 1997; thus, there is a great deal of cultural overlap between the two administrative divisions. There are many regional, local variations of Sichuanese cuisine within Sichuan and Chongqing. It has bold flavours, particularly the pungency and spiciness resulting from liberal use of garlic and chili peppers, as well as the unique flavour of Sichuan pepper. Some examples are Kung Pao chicken and Yuxiang shredded pork. Four sub-styles of Sichuan cuisine include Chongqing, Chengdu, Zigong (known for a genre of dishes called Yanbangcai), and Buddhist vegetarian style. UNESCO declared Chengdu, the capital of Sichuan Province, to be a city of gastronomy in 2011 to recognise the sophistication of its cooking.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "毛血旺",
      "english_name": "Mao xue wang",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Sichuan_cuisine",
      "timestamp": "2024-11-24T01:20:19.071573"
    }
  },
  {
    "id": "recipe_20241124_012020",
    "content": "Title: Maocai\nChinese Name: 冒菜\nEnglish Name: Maocai\nCuisine Type: 川菜（四川，重庆）\n\nMaocai (Chinese: 冒菜; pinyin: màocài) is a stew-like dish originating from the Chinese city of Chengdu, in Sichuan. It is composed of a variety of vegetables as well as meat and/or fish in a stock made of mala sauce. Although it is similar to styles of hot pot common in this region, its chief difference lies in the fact that the ingredients are already cooked when served, and hence no simmering is done at the table.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "冒菜",
      "english_name": "Maocai",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Maocai",
      "timestamp": "2024-11-24T01:20:20.575640"
    }
  },
  {
    "id": "recipe_20241124_012022",
    "content": "Title: Feastogether\nChinese Name: 口水鸡\nEnglish Name: Mouth-watering chicken\nCuisine Type: 川菜（四川，重庆）\n\nFeastogether Corporation (Chinese: 饗賓餐旅事業股份有限公司) is a Taiwanese multi-brand restaurant operator headquartered in Taoyuan's Qingpu Special District. Chen Chaoquan (Chinese: 陳朝全) founded Fuli Sichuan Banquet (Chinese: 福宴館（福利川菜）), the predecessor to Feastogether, in 1971. His son, Chen Qichang (Chinese: 陳啟昌), took charge of the restaurant business in 1979. Fuli Sichuan Banquet's primary clientele was the wedding reception market, which owing to Taiwan's declining birthrate began facing challenges. In response, Chen shifted the business's focus to all-you-can-eat restaurants. In 2002, he founded Feastogether Corporation and the Eat Together (Chinese: 饗食天堂) buffet brand. Chen Qiqang's son, Chen Yihang (Chinese: 陳毅航), became the company's general manager in 2009 and introduced an enterprise resource planning system. After creating the Eat Together buffet brand, Feastogether started several restaurant brands. It in 2011 created Kaifun Together (Chinese: 開飯川食堂), a Sichuan cuisine restaurant brand. In 2013, it started Fruitful Food (Chinese: 果然匯), a vegetarian and vegan buffet brand, and Siam More (Chinese: 饗泰多), a Thai restaurant brand. Feastogether founded Dacoz (Chinese: 大口吃), an American-style hamburger restaurant brand in 2016. The next year, it created the buffet brand Inparadise (Chinese: 饗饗) and Japanese-themed buffet brand Sunrise (Chinese: 旭集和食集錦). In 2020, it started Jin-Zhu (Chinese: 真珠台灣佳味), a Taiwanese-themed restaurant brand. Feastogether established Little Fuli Spicy Hot Pot (Chinese: 小福利麻辣鍋), a hot pot buffet brand, in 2021. The next year, Feastogether founded Doricious (Chinese: 朵頤餐廳), a Western-themed semi-buffet brand. A Joy (Chinese: 饗A Joy) opened in 2023 and was Taiwan's highest-priced buffet when it opened. Zhiyun (Chinese: 旨醞), a teppanyaki restaurant that provides set menu offerings, opened in 2024. The company opened several hub kitchens to supply its restaurants and the iEat (Chinese: iEAT饗愛吃) app in 2019. During the COVID-19 pandemic, it launched Eatogo, an online food ordering and delivery platform, and Eat@home, an e-commerce platform that sells frozen meal kits with dishes from its restaurant brands.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "口水鸡",
      "english_name": "Mouth-watering chicken",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Feastogether",
      "timestamp": "2024-11-24T01:20:22.237375"
    }
  },
  {
    "id": "recipe_20241124_012023",
    "content": "Title: Twice-cooked pork\nChinese Name: 回锅肉\nEnglish Name: Twice-cooked pork\nCuisine Type: 川菜（四川，重庆）\n\nTwice-cooked pork or double-cooked pork (Chinese: 回鍋肉; pinyin: huíguōròu; lit. 'meat returned to the pan (wok)') is a Chinese dish in Sichuan cuisine. The pork is simmered, sliced, and then stir-fried—\"returned to the wok.\" The pork is accompanied with stir-fried vegetables, most commonly garlic sprouts, but often baby leeks, cabbage, bell peppers, onions, or scallions. The sauce may include Shaoxing rice wine, hoisin sauce, soy sauce, sugar, ginger, chili bean paste, and sweet wheat paste. This dish is commonly associated with yan jian rou (Chinese: 鹽煎肉; lit. 'salted fried pork'), which tastes quite similar, but cooked in a different process.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "回锅肉",
      "english_name": "Twice-cooked pork",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Twice-cooked_pork",
      "timestamp": "2024-11-24T01:20:23.942778"
    }
  },
  {
    "id": "recipe_20241124_012025",
    "content": "Title: Bingfen\nChinese Name: 四川冰粉\nEnglish Name: bingfen\nCuisine Type: 川菜（四川，重庆）\n\nBingfen (Chinese: 冰粉; pinyin: bīngfěn), also called ice jelly, is a Chinese dessert native to Southwest China in provinces such as Sichuan, Guizhou, and Yunnan. It is served as a bowl of iced transparent jelly, made from the seeds of the Nicandra physalodes plant, along with toppings like haw flakes and wolfberries. It is commonly sold in the summertime as a street food.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "四川冰粉",
      "english_name": "bingfen",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Bingfen",
      "timestamp": "2024-11-24T01:20:25.425026"
    }
  },
  {
    "id": "recipe_20241124_012026",
    "content": "Title: Chongqing hot pot\nChinese Name: 重庆火锅\nEnglish Name: Chongqing hotpot\nCuisine Type: 川菜（四川，重庆）\n\nChongqing hot pot (simplified Chinese: 重庆火锅; traditional Chinese: 重慶火鍋; pinyin: Chóngqìng huǒguō), also known as spicy hot pot, is usually eaten at restaurants, but otherwise is similar to roadside malatang. Chongqing hot pot is similar to the dry stir-fried mala xiang guo (麻辣香锅) which is also eaten in restaurants. The traditional way of preparing and eating this style of dish is to put the food in a hot pot, wait for the food to cook, and when the food is ready, dip the pieces in sesame oil and eat them. People choose various kinds of food to prepare in Chongqing hot pot, such as beef, pork, chicken, Chinese sausages, beef strips, pig blood, and duck intestine.",
    "metadata": {
      "cuisine_type": "川菜（四川，重庆）",
      "dish_name": "重庆火锅",
      "english_name": "Chongqing hotpot",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Chongqing_hot_pot",
      "timestamp": "2024-11-24T01:20:26.932035"
    }
  },
  {
    "id": "recipe_20241124_012028",
    "content": "Title: Shuizhu\nChinese Name: 水煮鱼\nEnglish Name: Shuizhu\nCuisine Type: 西北菜 （陕西，甘肃等地）\n\nShuizhu (Chinese: 水煮; pinyin: shǔizhǔ, [ʂwěɪ ʈʂù ɻôʊ pʰjɛ̂n]) is a Chinese dish which originated from the cuisine of Sichuan province and the name literally means \"water boiled (meat)\". The preparation of this dish usually involves some sort of meat, usually beef, which is then called \"shǔizhǔròupiàn\" or fish when it's called \"shǔizhǔyú, 水煮鱼\", chili pepper, and a large amount of vegetable oil. The meat is prepared with water, starch, and a slight amount of salt. Boiled vegetables are placed at the bottom of the serving bowl or dish. The prepared raw meat is poached in water that is heated to boiling point for 20–30 seconds, just enough to remove rawness yet preserving the meat's tenderness. Then it is drained and put in the serving dish with vegetables. Minced dried chili, sichuan pepper, minced garlic, and other seasoning are spread over the meat. Vegetable oil is heated in a pan nearly to smoking point, then poured over the prepared meat and vegetable. This dish maintains tenderness of the meat by poaching it instead of stir frying. It offers a good combination of tender meat, freshness of vegetable, hot spicy flavor of chili pepper, and numbing sensation of Sichuan pepper.",
    "metadata": {
      "cuisine_type": "西北菜 （陕西，甘肃等地）",
      "dish_name": "水煮鱼",
      "english_name": "Shuizhu",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Shuizhu",
      "timestamp": "2024-11-24T01:20:28.612654"
    }
  },
  {
    "id": "recipe_20241124_012030",
    "content": "Title: Liangpi\nChinese Name: 米皮\nEnglish Name: Liangpi\nCuisine Type: 西北菜 （陕西，甘肃等地）\n\nLiangpi (simplified Chinese: 凉皮; traditional Chinese: 涼皮; pinyin: liángpí; lit. 'cold skin noodles') is a Chinese dish composed of cold noodles made from wheat or rice flour. It is a specialty dish originating from the cuisine of Shaanxi Province, but has now spread throughout China. In northwestern areas of China, it is often called liangpi zi (凉皮子). Although liangpi is served cold, they are served in every season, including winter.",
    "metadata": {
      "cuisine_type": "西北菜 （陕西，甘肃等地）",
      "dish_name": "米皮",
      "english_name": "Liangpi",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Liangpi",
      "timestamp": "2024-11-24T01:20:30.134899"
    }
  },
  {
    "id": "recipe_20241124_012031",
    "content": "Title: Liangpi\nChinese Name: 酿皮\nEnglish Name: Liangpi\nCuisine Type: 西北菜 （陕西，甘肃等地）\n\nLiangpi (simplified Chinese: 凉皮; traditional Chinese: 涼皮; pinyin: liángpí; lit. 'cold skin noodles') is a Chinese dish composed of cold noodles made from wheat or rice flour. It is a specialty dish originating from the cuisine of Shaanxi Province, but has now spread throughout China. In northwestern areas of China, it is often called liangpi zi (凉皮子). Although liangpi is served cold, they are served in every season, including winter.",
    "metadata": {
      "cuisine_type": "西北菜 （陕西，甘肃等地）",
      "dish_name": "酿皮",
      "english_name": "Liangpi",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Liangpi",
      "timestamp": "2024-11-24T01:20:31.443887"
    }
  },
  {
    "id": "recipe_20241124_012033",
    "content": "Title: Meatball\nChinese Name: 糖醋丸子\nEnglish Name: Sweet and sour meatballs\nCuisine Type: 西北菜 （陕西，甘肃等地）\n\nA meatball is ground meat (mince) rolled into a ball, sometimes along with other ingredients, such as bread crumbs, minced onion, eggs, butter, and seasoning. Meatballs are cooked by frying, baking, steaming, or braising in sauce. There are many types of meatballs using different types of meats and spices. The term is sometimes extended to meatless versions based on legumes, vegetables, mushrooms, fish (also commonly known as fish balls) or other seafood.",
    "metadata": {
      "cuisine_type": "西北菜 （陕西，甘肃等地）",
      "dish_name": "糖醋丸子",
      "english_name": "Sweet and sour meatballs",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Meatball",
      "timestamp": "2024-11-24T01:20:33.021932"
    }
  },
  {
    "id": "recipe_20241124_012034",
    "content": "Title: Beef shank\nChinese Name: 酱牛肉\nEnglish Name: Braised beef\nCuisine Type: 西北菜 （陕西，甘肃等地）\n\nThe beef shank is the leg portion of a steer or heifer. In the UK, the corresponding cuts of beef are the shin (the foreshank), and the leg (the hindshank). Due to the constant use of this muscle by the animal, it tends to be tough, dry, and sinewy, so is best when cooked for a long time in moist heat. It is an ideal cut to use for beef bourguignon. As it is very lean, it is widely used to prepare very low-fat ground beef. Due to its lack of sales, it is not often seen in shops. However, if found in retail, it is very cheap and a low-cost ingredient for beef stock. Beef shank is a common ingredient in soups. In Australia, it is commonly sold from butchers as gravy beef for bone-less shanks or as osso buco with bone-in. In Asia, braised beef shank is very popular.",
    "metadata": {
      "cuisine_type": "西北菜 （陕西，甘肃等地）",
      "dish_name": "酱牛肉",
      "english_name": "Braised beef",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Beef_shank",
      "timestamp": "2024-11-24T01:20:34.787981"
    }
  },
  {
    "id": "recipe_20241124_012036",
    "content": "Title: CeeDee Lamb\nChinese Name: 手抓羊肉\nEnglish Name: Hand-pulled lamb\nCuisine Type: 西北菜 （陕西，甘肃等地）\n\nCedarian DeLeon \"CeeDee\" Lamb (born April 8, 1999) is an American professional football wide receiver for the Dallas Cowboys of the National Football League (NFL). He played college football for the Oklahoma Sooners where he was a consensus All-American in 2019, and was selected by the Cowboys in the first round of the 2020 NFL draft.",
    "metadata": {
      "cuisine_type": "西北菜 （陕西，甘肃等地）",
      "dish_name": "手抓羊肉",
      "english_name": "Hand-pulled lamb",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/CeeDee_Lamb",
      "timestamp": "2024-11-24T01:20:36.324766"
    }
  },
  {
    "id": "recipe_20241124_012037",
    "content": "Title: Aspic\nChinese Name: 猪皮冻\nEnglish Name: Pork jelly\nCuisine Type: 西北菜 （陕西，甘肃等地）\n\nAspic () or meat jelly is a savory gelatin made with a meat stock or broth, set in a mold to encase other ingredients. These often include pieces of meat, seafood, vegetable, or eggs. Aspic is also sometimes referred to as aspic gelée or aspic jelly. In its simplest form, aspic is essentially a gelatinous version of conventional soup.",
    "metadata": {
      "cuisine_type": "西北菜 （陕西，甘肃等地）",
      "dish_name": "猪皮冻",
      "english_name": "Pork jelly",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Aspic",
      "timestamp": "2024-11-24T01:20:37.865441"
    }
  },
  {
    "id": "recipe_20241124_012039",
    "content": "Title: Liangpi\nChinese Name: 面皮/凉皮\nEnglish Name: Liang pi\nCuisine Type: 西北菜 （陕西，甘肃等地）\n\nLiangpi (simplified Chinese: 凉皮; traditional Chinese: 涼皮; pinyin: liángpí; lit. 'cold skin noodles') is a Chinese dish composed of cold noodles made from wheat or rice flour. It is a specialty dish originating from the cuisine of Shaanxi Province, but has now spread throughout China. In northwestern areas of China, it is often called liangpi zi (凉皮子). Although liangpi is served cold, they are served in every season, including winter.",
    "metadata": {
      "cuisine_type": "西北菜 （陕西，甘肃等地）",
      "dish_name": "面皮/凉皮",
      "english_name": "Liang pi",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Liangpi",
      "timestamp": "2024-11-24T01:20:39.574307"
    }
  },
  {
    "id": "recipe_20241124_012041",
    "content": "Title: Sour soup fish\nChinese Name: 凯里酸汤鱼\nEnglish Name: Sour soup fish\nCuisine Type: 黔菜 (贵州）\n\nSour soup fish (Chinese: 酸汤鱼; pinyin: suān tāng yú) is a representative dish of Guizhou Province, China. It originated from the Miao ethnic cuisine in Qiandongnan Miao-Dong Autonomous Prefecture several hundred years ago. Sour Soup Fish is commonly served at Miao weddings, baby's first month celebrations, gatherings, and when entertaining guests. The sour soup is made by fermenting glutinous rice flour and simmering it with locally grown cherry tomatoes from Guizhou. The soup is then cooked with carp, grass carp, or black fish and seasoned with chili, Sichuan peppercorn, salt, and other spices. Sour soup fish is popular for its tender fish meat and delicious sour flavor. Additionally, there is also a variation of the dish that uses pickled tomatoes as an ingredient for the sour soup. It is cooked with carp, soybean sprouts, bamboo shoots, tofu, and served with fermented bean curd, cilantro, and chili as dipping sauce.",
    "metadata": {
      "cuisine_type": "黔菜 (贵州）",
      "dish_name": "凯里酸汤鱼",
      "english_name": "Sour soup fish",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Sour_soup_fish",
      "timestamp": "2024-11-24T01:20:41.108429"
    }
  },
  {
    "id": "recipe_20241124_012042",
    "content": "Title: Tahu goreng\nChinese Name: 豆腐圆子\nEnglish Name: Tofu balls\nCuisine Type: 黔菜 (贵州）\n\nTahu goreng (Indonesian spelling) or Tauhu goreng (Bruneian, Malaysian and Singaporean spelling) is a generic name for any type of fried tofu dish in the cuisines of Indonesia, Brunei, Malaysia and Singapore.",
    "metadata": {
      "cuisine_type": "黔菜 (贵州）",
      "dish_name": "豆腐圆子",
      "english_name": "Tofu balls",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Tahu_goreng",
      "timestamp": "2024-11-24T01:20:42.637816"
    }
  },
  {
    "id": "recipe_20241124_012044",
    "content": "Title: Lotus leaf bread\nChinese Name: 荷叶粉蒸肉\nEnglish Name: Lotus leaf steamed pork\nCuisine Type: 黔菜 (贵州）\n\nLotus leaf bread (Chinese: 荷叶饼; pinyin: hé yè bǐng) is a Chinese steamed bread. Semi-circular and flat, the loaves have a horizontal fold that, when opened, gives the appearance that it has been sliced. Lines or patterns may be added to increase the resemblance to a lotus leaf. The buns are traditionally eaten with rich meat dishes such as roast duck or pork belly. They may also be stuffed, which is referred to as a lotus leaf bun (Chinese: 荷叶包; pinyin: hé yè bāo). Lotus leaf bread is best known outside China as the bread used in the Fujianese dish gua bao.",
    "metadata": {
      "cuisine_type": "黔菜 (贵州）",
      "dish_name": "荷叶粉蒸肉",
      "english_name": "Lotus leaf steamed pork",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Lotus_leaf_bread",
      "timestamp": "2024-11-24T01:20:44.407345"
    }
  },
  {
    "id": "recipe_20241124_012045",
    "content": "Title: Bouyei people\nChinese Name: 水城烙锅\nEnglish Name: Shuicheng lao guo\nCuisine Type: 黔菜 (贵州）\n\nThe Bouyei (also spelled Puyi, Buyei and Buyi; self called: Buxqyaix, [puʔjai] or \"Puzhong\", \"Burao\", \"Puman\"; Chinese: 布依族; pinyin: Bùyīzú; Vietnamese: người Bố Y), otherwise known as the Zhongjia, are an ethnic group living in Southern Mainland China. Numbering 2.5 million, they are the 11th largest of the 56 ethnic groups officially recognized by the People's Republic of China. The Bouyei mostly live in Qianxinan and Qiannan prefectures of Southern Guizhou Province, as well as in Yunnan and Sichuan Provinces. Some 3,000 Bouyei also live in Northern Vietnam, where they are one of that nation's 54 officially recognized ethnic groups. In Vietnam, they are located in Mường Khương District of Lào Cai and Quản Bạ District of Hà Giang Province.",
    "metadata": {
      "cuisine_type": "黔菜 (贵州）",
      "dish_name": "水城烙锅",
      "english_name": "Shuicheng lao guo",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Bouyei_people",
      "timestamp": "2024-11-24T01:20:45.995564"
    }
  },
  {
    "id": "recipe_20241124_012047",
    "content": "Title: Laziji\nChinese Name: 辣子鸡\nEnglish Name: laziji\nCuisine Type: 黔菜 (贵州）\n\nLaziji (simplified Chinese: 辣子鸡; traditional Chinese: 辣子雞; pinyin: làzijī; lit. 'spicy chicken'), also known as dry chili chicken, firecracker chicken, Chongqing chicken, and mala chicken, is a dish of chicken cubes stir-fried in chilis, Szechuan pepper, spicy fermented bean paste, garlic, and ginger. Toasted sesame seeds and sliced spring onions are often used to garnish the dish. Laziji originated near Geleshan in Chongqing, where restaurateurs used small free-range chickens from nearby farms. This poultry became a signature export for Geleshan.",
    "metadata": {
      "cuisine_type": "黔菜 (贵州）",
      "dish_name": "辣子鸡",
      "english_name": "laziji",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Laziji",
      "timestamp": "2024-11-24T01:20:47.460939"
    }
  },
  {
    "id": "recipe_20241124_012049",
    "content": "Title: Wa State\nChinese Name: 丝娃娃\nEnglish Name: Si wa wa\nCuisine Type: 黔菜 (贵州）\n\nWa State is a de facto independent state in Myanmar (Burma) that has its own political system, administrative divisions and army. While the Wa State government recognises Myanmar's sovereignty over all of its territory, this does not include allegiance to any specific government. The 2008 Constitution of Myanmar officially recognises the northern part of Wa State as the Wa Self-Administered Division of Shan State. As a one-party socialist state ruled by the United Wa State Party (UWSP), which split from the Communist Party of Burma (CPB) in 1989, Wa State is divided into three counties, two special districts, and one economic development zone. The administrative capital is Pangkham, formerly known as Pangsang. The name Wa is derived from the Wa ethnic group, who speak an Austroasiatic language.",
    "metadata": {
      "cuisine_type": "黔菜 (贵州）",
      "dish_name": "丝娃娃",
      "english_name": "Si wa wa",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Wa_State",
      "timestamp": "2024-11-24T01:20:49.165587"
    }
  },
  {
    "id": "recipe_20241124_012050",
    "content": "Title: Red braised pork belly\nChinese Name: 毛式红烧肉\nEnglish Name: Mao-style red braised pork\nCuisine Type: 苏菜（江苏）\n\nRed braised pork belly or hong shao rou (simplified Chinese: 红烧肉; traditional Chinese: 紅燒肉; pinyin: hóngshāoròu) is a classic pork dish from China, red-cooked using pork belly and a combination of ginger, garlic, aromatic spices, chilis, sugar, star anise, light and dark soy sauce, and rice wine. The pork belly is cooked until the fat and skin are gelatinous, soft, and melt easily in the mouth, while the sauce is usually thick, sweet and fairly sticky. The dish has a melt-in-the-mouth texture that is formed as a result of a long braising process, during which the liquid reduces and becomes thick. It is generally served with steamed rice and dark green vegetables, often over holidays. The dish is often prepared with hard-boiled chicken eggs or vegetables, which are used to soak up the juices from the recipe. Many Chinese provinces have slightly different versions, but the Hunanese one (often called \"Mao's family style red braised pork\" (Chinese: 毛氏紅燒肉; pinyin: Máo shì hóngshāoròu)) is often said to have been one of Chairman Mao's favorite dishes, and is served at the many Hunan restaurants across China specializing in so called \"Mao-style cuisine\". The popularity of the dish has led the Hunan provincial government to codify the recipe of the dish, in particular deciding that only meat of the celebrated Ningxiang breed of pig should be used in authentic hongshao rou.",
    "metadata": {
      "cuisine_type": "苏菜（江苏）",
      "dish_name": "毛式红烧肉",
      "english_name": "Mao-style red braised pork",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Red_braised_pork_belly",
      "timestamp": "2024-11-24T01:20:50.767411"
    }
  },
  {
    "id": "recipe_20241124_012052",
    "content": "Title: Nanjing salted duck\nChinese Name: 盐水鸭\nEnglish Name: Nanjing salted duck\nCuisine Type: 苏菜（江苏）\n\nNanjing salted duck (simplified Chinese: 盐水鸭; traditional Chinese: 鹽水鴨; pinyin: yánshuǐ yā) is a local duck dish from Nanjing, China. The history of the dish goes back hundreds of years, possibly to the 14th century, but it grew more famous during the Qing Dynasty. The tender white duck-meat has some fat but is not greasy, and in presentation the dish is fragrant and often crispy. Although available all year round, experts believe that duck in autumn inherently possesses a sweet scent of osmanthus and is therefore best in this season. In line with this statement, some cooked-meat product shops have started experimenting with the use of osmanthus to flavour duck. Nanjing salted duck prepared shortly before or after mid-Autumn is reputed to taste the best, because of duck production during the sweet osmanthus blooming season (osmanthus may be added to the spice mixture particularly in those months). Sometimes the seasonal version of the dish is called \"osmanthus duck\". Nanjing is a culinary centre noted for its Jinling dishes, especially quality ducks and a whole variety of duck dishes. Over 100 million ducks per year are eaten in the city of 8 million. Nanjing salted duck reigns supreme on the table in southern China, just as Peking duck reigns supreme in northern China. For the people of Nanjing, eating salted duck once a day seems to have become a regular habit. Some historians believe that the ducks were first raised as livestock by the Nanjing people more than two thousand years ago. The Nanjing salted duck is recorded as a gourmet entry in the List of Jinling’s Delicacies by the modern Chinese gourmet Tongzhi Zhang. Most of Nanjing's most famous duck shops are located around the Shuiximen area. The key to the formation of the unique flavour of Nanjing salted duck is the oxidation and degradation of the duck fat, which is achieved throughout the production process through a series of steps including dry-curing, salting, roasting and boiling. In parts of China, taro and salted duck are a unique combination. Over the years, Nanjing salted duck has achieved a number of honourable achievements in different fields.",
    "metadata": {
      "cuisine_type": "苏菜（江苏）",
      "dish_name": "盐水鸭",
      "english_name": "Nanjing salted duck",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Nanjing_salted_duck",
      "timestamp": "2024-11-24T01:20:52.316474"
    }
  },
  {
    "id": "recipe_20241124_012054",
    "content": "Title: Xiaolongbao\nChinese Name: 无锡小笼包\nEnglish Name: Wuxi xiaolongbao\nCuisine Type: 苏菜（江苏）\n\nXiaolongbao (小籠包 , 'little basket bun') is a type of Chinese tangbao (Chinese: 汤包), traditionally prepared in a xiaolong, a small bamboo steaming basket. The xiaolongbao originates from the city of Changzhou in Jiangsu province, and is an iconic dish of Jiangnan cuisine. Different cities across the Jiangnan region have varying styles of xiaolongbao. Outside of China, the Nanxiang xiaolongbao associated with Shanghai is the most well known. In the Shanghainese language, they are known as siaulon moedeu or xiaolong mantou, as Wu Chinese-speaking peoples use the traditional definition of mantou, which refers to both filled and unfilled buns. The Suzhou and Wuxi styles are larger (sometimes twice as large as a Nanxiang xiaolongbao) and have sweeter fillings. The Nanjing style is smaller with an almost translucent skin and less meat. In English, the xiaolongbao are often referred to as \"soup dumplings\", but \"soup dumpling\" in Chinese may translate to the broader culinary category known as tangbao, which includes the xiaolongbao and other related dishes. Xiaolongbao are popular all over the world and many restaurants are known for their unique interpretations of this classic dish, such as Din Tai Fung, Nanxiang Steamed Bun Restaurant, and Joe's Shanghai.",
    "metadata": {
      "cuisine_type": "苏菜（江苏）",
      "dish_name": "无锡小笼包",
      "english_name": "Wuxi xiaolongbao",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Xiaolongbao",
      "timestamp": "2024-11-24T01:20:54.041930"
    }
  },
  {
    "id": "recipe_20241124_012055",
    "content": "Title: Squirrel fish\nChinese Name: 松鼠鱼\nEnglish Name: Squirrel fish\nCuisine Type: 苏菜（江苏）\n\nSquirrel shape fried fish (Chinese: 松鼠鱖魚; pinyin: sōngshǔ guìyú) is a well-known dish in Jiangsu cuisine, originally from Suzhou. It is prepared by deboning and carving a mandarin fish into an ornamental shape similar to a squirrel, and then deep-frying it in batter before dousing it in sweet and sour sauce.",
    "metadata": {
      "cuisine_type": "苏菜（江苏）",
      "dish_name": "松鼠鱼",
      "english_name": "Squirrel fish",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Squirrel_fish",
      "timestamp": "2024-11-24T01:20:55.730180"
    }
  },
  {
    "id": "recipe_20241124_012057",
    "content": "Title: Qingtuan\nChinese Name: 青团\nEnglish Name: Qingtuan\nCuisine Type: 苏菜（江苏）\n\nQīngtuán (traditional Chinese: 青糰; simplified Chinese: 青团), also written as Tsingtuan, is a green-colored dumpling originating from Jiangnan and common throughout China. It is made of glutinous rice mixed with Chinese mugwort or barley grass. It is usually filled with sweet red or black bean paste. The exact technique for making qingtuan is quite complicated and the grass involved is only edible in the early spring, so it is typically only available around the time of the Qingming Festival (April 4 or 5), with which the rice cake has become associated. Nowadays, qingtuan sold in most convenience stores in China are made of glutinous rice mixed with matcha. Modern versions use a wider variety of fillings, such as rousong or salted egg yolk. Much of the qingtuan consumed in China is prepared and consumed as street food from local vendors.",
    "metadata": {
      "cuisine_type": "苏菜（江苏）",
      "dish_name": "青团",
      "english_name": "Qingtuan",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Qingtuan",
      "timestamp": "2024-11-24T01:20:57.225266"
    }
  },
  {
    "id": "recipe_20241124_012058",
    "content": "Title: Cotton\nChinese Name: 太湖银鱼\nEnglish Name: Lake Tai silverfish\nCuisine Type: 苏菜（江苏）\n\nCotton (from Arabic al-qutn) is a soft, fluffy staple fiber that grows in a boll, or protective case, around the seeds of the cotton plants of the genus Gossypium in the mallow family Malvaceae. The fiber is almost pure cellulose, and can contain minor percentages of waxes, fats, pectins, and water. Under natural conditions, the cotton bolls will increase the dispersal of the seeds. The plant is a shrub native to tropical and subtropical regions around the world, including the Americas, Africa, Egypt and India. The greatest diversity of wild cotton species is found in Mexico, followed by Australia and Africa. Cotton was independently domesticated in the Old and New Worlds. The fiber is most often spun into yarn or thread and used to make a soft, breathable, and durable textile. The use of cotton for fabric is known to date to prehistoric times; fragments of cotton fabric dated to the fifth millennium BC have been found in the Indus Valley civilization, as well as fabric remnants dated back to 4200 BC in Peru. Although cultivated since antiquity, it was the invention of the cotton gin that lowered the cost of production that led to its widespread use, and it is the most widely used natural fiber cloth in clothing today. Current estimates for world production are about 25 million tonnes or 110 million bales annually, accounting for 2.5% of the world's arable land. India is the world's largest producer of cotton. The United States has been the largest exporter for many years.",
    "metadata": {
      "cuisine_type": "苏菜（江苏）",
      "dish_name": "太湖银鱼",
      "english_name": "Lake Tai silverfish",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Cotton",
      "timestamp": "2024-11-24T01:20:58.929882"
    }
  },
  {
    "id": "recipe_20241124_012100",
    "content": "Title: Huaiyang cuisine\nChinese Name: 响油鳝糊\nEnglish Name: Crispy eel paste\nCuisine Type: 苏菜（江苏）\n\nHuaiyang or Jianghuai cuisine is one of the Four Great Traditions in Chinese cuisine. It is derived from the native cooking styles of the region surrounding the lower reaches of the Huai and Yangtze rivers and centered on the cities of Huai'an, Yangzhou and Zhenjiang in Jiangsu Province. Although it is one of several sub-regional styles within Jiangsu cuisine, Huaiyang cuisine is widely seen in Chinese culinary circles as the most popular and prestigious style of Jiangsu cuisine, to a point where it is considered to be one of the Four Great Traditions (四大菜系; Sì dà càixì) that dominate the culinary heritage of China, along with Cantonese cuisine, Shandong cuisine, and Sichuan cuisine.",
    "metadata": {
      "cuisine_type": "苏菜（江苏）",
      "dish_name": "响油鳝糊",
      "english_name": "Crispy eel paste",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Huaiyang_cuisine",
      "timestamp": "2024-11-24T01:21:00.527425"
    }
  },
  {
    "id": "recipe_20241124_012102",
    "content": "Title: Noodle soup\nChinese Name: 阳春面\nEnglish Name: Yang chun noodles\nCuisine Type: 苏菜（江苏）\n\nNoodle soup refers to a variety of soups with noodles and other ingredients served in a light broth. Noodle soup is a common dish across East Asia, Southeast Asia and the Himalayan states of South Asia. Various types of noodles are used, such as rice noodles, wheat noodles and egg noodles.",
    "metadata": {
      "cuisine_type": "苏菜（江苏）",
      "dish_name": "阳春面",
      "english_name": "Yang chun noodles",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Noodle_soup",
      "timestamp": "2024-11-24T01:21:02.067566"
    }
  },
  {
    "id": "recipe_20241124_012103",
    "content": "Title: Wonton\nChinese Name: 蟹黄汤包\nEnglish Name: Crab roe soup dumplings\nCuisine Type: 苏菜（江苏）\n\nA wonton (traditional Chinese: 餛飩; simplified Chinese: 馄饨; pinyin: húntun; Jyutping: wan4 tan4) is a type of Chinese dumpling commonly found across regional styles of Chinese cuisine. It is also spelled wantan or wuntun in transliteration from Cantonese 雲吞 / 云吞 (wan4 tan1) and wenden from Shanghainese 餛飩 / 馄饨 (hhun den). Even though there are many different styles of wonton served throughout China, Cantonese wontons are the most popular in the West due to the predominance of Cantonese restaurants overseas. Wontons, which have their origins in China, has achieved significant popularity as a sought-after delicacy that is not only celebrated and enjoyed in East Asian cuisine, but also across various Southeast Asian culinary traditions as well.",
    "metadata": {
      "cuisine_type": "苏菜（江苏）",
      "dish_name": "蟹黄汤包",
      "english_name": "Crab roe soup dumplings",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Wonton",
      "timestamp": "2024-11-24T01:21:03.772344"
    }
  },
  {
    "id": "recipe_20241124_012105",
    "content": "Title: Rice noodle roll\nChinese Name: 鸡蛋肠粉\nEnglish Name: Egg cheung fun\nCuisine Type: 粤菜（广东等地）\n\nA rice noodle roll, also known as a steamed rice roll and cheung fun (Chinese: 腸粉), and as look funn or look fun in Hawaii, is a Cantonese dish originating from Guangdong Province in southern China, commonly served as either a snack, small meal or variety of dim sum. It is a thin roll made from a wide strip of shahe fen (rice noodles), filled with shrimp, beef, vegetables, or other ingredients. Seasoned soy sauce – sometimes with siu mei drippings – is poured over the dish upon serving. When plain and made without filling, the rice noodle is also known as jyu cheung fun, literally \"pork intestine noodle\", a reference to its resemblance of a pig's intestines. There is no official recording of the history of rice noodle rolls; most cookbooks claim that it was first made in the 1930s. In Guangzhou, Guangdong Province, people called the dish laai cheung (lit. 'pull intestines') because it is a noodle roll that pulled by hand.",
    "metadata": {
      "cuisine_type": "粤菜（广东等地）",
      "dish_name": "鸡蛋肠粉",
      "english_name": "Egg cheung fun",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Rice_noodle_roll",
      "timestamp": "2024-11-24T01:21:05.319745"
    }
  },
  {
    "id": "recipe_20241124_012106",
    "content": "Title: Rice noodle roll\nChinese Name: 红米肠粉\nEnglish Name: Red rice cheung fun\nCuisine Type: 粤菜（广东等地）\n\nA rice noodle roll, also known as a steamed rice roll and cheung fun (Chinese: 腸粉), and as look funn or look fun in Hawaii, is a Cantonese dish originating from Guangdong Province in southern China, commonly served as either a snack, small meal or variety of dim sum. It is a thin roll made from a wide strip of shahe fen (rice noodles), filled with shrimp, beef, vegetables, or other ingredients. Seasoned soy sauce – sometimes with siu mei drippings – is poured over the dish upon serving. When plain and made without filling, the rice noodle is also known as jyu cheung fun, literally \"pork intestine noodle\", a reference to its resemblance of a pig's intestines. There is no official recording of the history of rice noodle rolls; most cookbooks claim that it was first made in the 1930s. In Guangzhou, Guangdong Province, people called the dish laai cheung (lit. 'pull intestines') because it is a noodle roll that pulled by hand.",
    "metadata": {
      "cuisine_type": "粤菜（广东等地）",
      "dish_name": "红米肠粉",
      "english_name": "Red rice cheung fun",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Rice_noodle_roll",
      "timestamp": "2024-11-24T01:21:06.941381"
    }
  },
  {
    "id": "recipe_20241124_012108",
    "content": "Title: Cha siu bao\nChinese Name: 叉烧包\nEnglish Name: Char siu bao\nCuisine Type: 粤菜（广东等地）\n\nCha siu bao (simplified Chinese: 叉烧包; traditional Chinese: 叉燒包; pinyin: chāshāo bāo; Jyutping: caa1 siu1 baau1; Cantonese Yale: chā sīu bāau; lit. 'barbecued pork bun') is a Cantonese baozi (bun) filled with barbecue-flavored cha siu pork. They are served as a type of dim sum during yum cha and are sometimes sold in Chinese bakeries.",
    "metadata": {
      "cuisine_type": "粤菜（广东等地）",
      "dish_name": "叉烧包",
      "english_name": "Char siu bao",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Cha_siu_bao",
      "timestamp": "2024-11-24T01:21:08.527581"
    }
  },
  {
    "id": "recipe_20241124_012110",
    "content": "Title: Black pepper\nChinese Name: 黑椒牛仔骨\nEnglish Name: Black pepper short ribs\nCuisine Type: 粤菜（广东等地）\n\nBlack pepper (Piper nigrum) is a flowering vine in the family Piperaceae, cultivated for its fruit (the peppercorn), which is usually dried and used as a spice and seasoning. The fruit is a drupe (stonefruit) which is about 5 mm (0.20 in) in diameter (fresh and fully mature), dark red, and contains a stone which encloses a single pepper seed. Peppercorns and the ground pepper derived from them may be described simply as pepper, or more precisely as black pepper (cooked and dried unripe fruit), green pepper (dried unripe fruit), or white pepper (ripe fruit seeds). Black pepper is native to the Malabar Coast of India, and the Malabar pepper is extensively cultivated there and in other tropical regions. Ground, dried, and cooked peppercorns have been used since antiquity, both for flavour and as a traditional medicine. Black pepper is the world's most traded spice, and is one of the most common spices added to cuisines around the world. Its spiciness is due to the chemical compound piperine, which is a different kind of spiciness from that of capsaicin characteristic of chili peppers. It is ubiquitous in the Western world as a seasoning, and is often paired with salt and available on dining tables in shakers or mills.",
    "metadata": {
      "cuisine_type": "粤菜（广东等地）",
      "dish_name": "黑椒牛仔骨",
      "english_name": "Black pepper short ribs",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Black_pepper",
      "timestamp": "2024-11-24T01:21:10.277724"
    }
  },
  {
    "id": "recipe_20241124_012111",
    "content": "Title: Har gow\nChinese Name: 虾饺\nEnglish Name: Har gow\nCuisine Type: 粤菜（广东等地）\n\nHar gow (Chinese: 蝦餃; pinyin: xiājiǎo; Jyutping: haa1 gaau2; lit. 'shrimp jiao'), also anglicized as ha gow, hau kau, ha kao, is a traditional Cantonese dumpling served as dim sum. It is made of shrimp meat, and steamed in a flour wrapper. After cooking, the wrapper becomes somewhat translucent, and therefore har gow is sometimes called crystal shrimp dumplings (水晶蝦餃).",
    "metadata": {
      "cuisine_type": "粤菜（广东等地）",
      "dish_name": "虾饺",
      "english_name": "Har gow",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Har_gow",
      "timestamp": "2024-11-24T01:21:11.799768"
    }
  },
  {
    "id": "recipe_20241124_012113",
    "content": "Title: Claypot rice\nChinese Name: 煲仔饭\nEnglish Name: Claypot rice\nCuisine Type: 粤菜（广东等地）\n\nClaypot rice (Chinese: 煲仔飯; Jyutping: bou1 zai2 faan6), sometimes translated as \"rice casserole\", is a Chinese traditional dinner eaten widely in Guangdong in Southern China as well as the Chinese communities of Malaysia, Indonesia, Singapore and Thailand. The rice is presoaked, or in some cases par-cooked, and finished in the claypot with other ingredients which then flavor the rice. The bottom develops a scorched rice crust similar to that in Korean dolsot bibimbap or Iranian “tahdig” and Spanish paella. It is commonly served with chicken, Chinese sausage and vegetables in some regions, but most restaurants offer a customizable dish with many protein options. Traditionally, the cooking is done over a charcoal stove, giving the dish a distinctive flavour. Some places serve it with thick, sweetened soy sauce and sometimes dried salted fish. Due to the time-consuming method of preparation and slow-cooking in a claypot, customers may have to wait a period of time (typically 15–30 minutes) before the dish is ready.",
    "metadata": {
      "cuisine_type": "粤菜（广东等地）",
      "dish_name": "煲仔饭",
      "english_name": "Claypot rice",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Claypot_rice",
      "timestamp": "2024-11-24T01:21:13.319794"
    }
  },
  {
    "id": "recipe_20241124_012115",
    "content": "Title: Brisket\nChinese Name: 咖喱牛腩牛筋面\nEnglish Name: Curry beef brisket noodles\nCuisine Type: 粤菜（广东等地）\n\nBrisket is a cut of meat from the breast or lower chest of beef or veal. The beef brisket is one of the nine beef primal cuts, though the definition of the cut differs internationally. The brisket muscles include the superficial and deep pectorals. As cattle do not have collar bones, these muscles support about 60% of the body weight of standing or moving cattle. This requires a significant amount of connective tissue, so the resulting meat must be cooked correctly to tenderise it. According to the Random House Dictionary of the English Language, Second Edition, the term derives from the Middle English brusket which comes from the earlier Old Norse brjósk, meaning cartilage. The cut overlies the sternum, ribs, and connecting costal cartilages.",
    "metadata": {
      "cuisine_type": "粤菜（广东等地）",
      "dish_name": "咖喱牛腩牛筋面",
      "english_name": "Curry beef brisket noodles",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Brisket",
      "timestamp": "2024-11-24T01:21:15.067333"
    }
  },
  {
    "id": "recipe_20241124_012116",
    "content": "Title: Fish ball\nChinese Name: 鱼丸粉\nEnglish Name: Fish ball\nCuisine Type: 粤菜（广东等地）\n\nFish balls are the balls made from fish paste which are then boiled or deep-fried. Similar in composition to fishcake, fish balls are often made from fish mince or surimi, salt, and a culinary binder such as tapioca flour, corn, or potato starch. Fish balls are popular in East and Southeast Asia, Europe (especially Northern Europe), and some coastal countries of West Africa. In Asia they are eaten as a snack or added to soups or hotpot dishes. They are usually attributed to Chinese cuisine and the fish ball industry is largely operated by people of Chinese descent.: 286 European versions tend to be less processed, sometimes using milk or potatoes for binding. Nordic countries like Norway, Denmark and Sweden each have their own variation.",
    "metadata": {
      "cuisine_type": "粤菜（广东等地）",
      "dish_name": "鱼丸粉",
      "english_name": "Fish ball",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Fish_ball",
      "timestamp": "2024-11-24T01:21:16.605810"
    }
  },
  {
    "id": "recipe_20241124_012118",
    "content": "Title: Roast goose\nChinese Name: 脆皮烧鹅\nEnglish Name: Roast goose\nCuisine Type: 粤菜（广东等地）\n\nRoast goose is cooking goose meat using dry heat with hot air enveloping it evenly on all sides. Many varieties of roast goose appear in cuisines around the world, including Cantonese, European, and Middle Eastern cuisines. Roasting can enhance its flavor.",
    "metadata": {
      "cuisine_type": "粤菜（广东等地）",
      "dish_name": "脆皮烧鹅",
      "english_name": "Roast goose",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Roast_goose",
      "timestamp": "2024-11-24T01:21:18.118544"
    }
  },
  {
    "id": "recipe_20241124_012119",
    "content": "Title: MasterChef (American TV series) season 10\nChinese Name: 清蒸鲈鱼\nEnglish Name: Steamed bass\nCuisine Type: 粤菜（广东等地）\n\nThe tenth season of the American competitive reality television series MasterChef premiered on Fox on May 29, 2019, and concluded on September 18, 2019. Gordon Ramsay, Aarón Sánchez, and Joe Bastianich all returned as judges. The season was won by creeler Dorian Hunter, with former Army interrogator Sarah Faherty finishing second, and college student Nick DiGiovanni placing third.",
    "metadata": {
      "cuisine_type": "粤菜（广东等地）",
      "dish_name": "清蒸鲈鱼",
      "english_name": "Steamed bass",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/MasterChef_(American_TV_series)_season_10",
      "timestamp": "2024-11-24T01:21:19.828582"
    }
  },
  {
    "id": "recipe_20241124_012121",
    "content": "Title: Beef chow fun\nChinese Name: 干炒牛河\nEnglish Name: Beef chow fun\nCuisine Type: 粤菜（广东等地）\n\nBeef chow fun, also known as beef ho fun, gōn cháau ngàuh hó, or gānchǎo níuhé in Chinese (乾炒牛河) meaning \"dry fried beef Shahe noodles\", is a staple Cantonese dish made from stir-frying beef, hor fun (wide rice noodles) and bean sprouts. It is commonly found in yum cha restaurants in Guangdong, Hong Kong, and overseas, as well as in cha chaan tengs. Chow fun, or stir-fried hor fun (shahe fen) noodles, is any number of different individual preparations (and could be compared to the number of pizza varieties in United States cuisine). In the Philippines, it is called \"beef hofan\" (河粉). The main ingredient of this dish is hor fun noodles, which is also known as shahe fen, originating in the town of Shahe in Guangzhou. It is a wide, flat noodle that is cut into shape (qiefen). The most common methods of cooking hor fun are in soup or stir fried. Hor fun can be dry-fried (fried only with condiments such as soy sauce) or wet-fried (fried with a thickening sauce). Today, the dry-fried variant is much more common, to the extent that the method is usually not specified—\"hor fun\" on a restaurant menu would refer to dry-fried hor fun. Further, wet-fried hor fun usually includes seafood, while dry-fried hor fun usually includes beef or chicken. Sliced beef is marinated first. Then, the beef is seared in a wok; this is important to obtain the signature taste of beef chow fun (wok hei). Other ingredients and the hor fun noodles are added, then combined with the beef and sauce. The bean sprouts are then stir-fried with the rest of the chow fun until they are tender and the dish is ready to serve. An important factor in the making of this dish is wok hei (鑊氣). The cooking must be done over a high flame and the stirring must be done quickly. Not only must the hor fun be stirred quickly, it must not be handled too strongly or it will break into pieces. The amount of oil also needs to be controlled very well; if not, the excess oil or dry texture will ruin the dish. Because of these factors, this dish is a major test for chefs in Cantonese cooking. This wok hei provides an almost charred flavor which is hard to obtain without high heat.",
    "metadata": {
      "cuisine_type": "粤菜（广东等地）",
      "dish_name": "干炒牛河",
      "english_name": "Beef chow fun",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Beef_chow_fun",
      "timestamp": "2024-11-24T01:21:21.415934"
    }
  },
  {
    "id": "recipe_20241124_012122",
    "content": "Title: Steamed meatball\nChinese Name: 陈皮牛肉丸\nEnglish Name: Steamed meatballs\nCuisine Type: 粤菜（广东等地）\n\nSteamed meatball is a common Cantonese dim sum dish. It is popular in Hong Kong and most overseas Chinatowns. The meatballs are usually made of minced beef, with water chestnut to add texture and with coriander and a few slivers of chan pei or dried orange peel used as seasoning. A layer of tofu skin, or sometimes peas, are used to raise the meatballs from the bottom of the dish and prevent them from sitting in the cooking juices. It is generally served with Worcestershire sauce (Chinese: 喼汁; Jyutping: gip1 zap1; Cantonese Yale: gīp jāp; pinyin: jiézhī).",
    "metadata": {
      "cuisine_type": "粤菜（广东等地）",
      "dish_name": "陈皮牛肉丸",
      "english_name": "Steamed meatballs",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Steamed_meatball",
      "timestamp": "2024-11-24T01:21:22.941944"
    }
  },
  {
    "id": "recipe_20241124_012124",
    "content": "Title: Anhui cuisine\nChinese Name: 臭鳜鱼\nEnglish Name: Stinky mandarin fish\nCuisine Type: 徽菜 （安徽）\n\nAnhui cuisine, alternatively referred to as Hui cuisine, is one of the Eight Culinary Traditions of Chinese cuisine. It is derived from the native cooking styles of the Huangshan region in southern Anhui Province.",
    "metadata": {
      "cuisine_type": "徽菜 （安徽）",
      "dish_name": "臭鳜鱼",
      "english_name": "Stinky mandarin fish",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Anhui_cuisine",
      "timestamp": "2024-11-24T01:21:24.655890"
    }
  },
  {
    "id": "recipe_20241124_012126",
    "content": "Title: List of pork dishes\nChinese Name: 猪血丸子\nEnglish Name: Pork blood balls\nCuisine Type: 湘菜（湖南）\n\nThis is a list of notable pork dishes. Pork is the culinary name for meat from the domestic pig (Sus domesticus). It is one of the most commonly consumed meats worldwide, with evidence of pig husbandry dating back to 5000 BC. Pork is eaten both freshly cooked and preserved. The consumption of pork is prohibited in Judaism, Islam, and some Christian denominations such as Seventh-day Adventism. Consuming fresh pork may lead to trichinosis, a parasitic disease caused by eating raw or undercooked pork or wild game infected with the larvae of a species of roundworm Trichinella spiralis, commonly called the trichina worm. In the United States, the U.S. Department of Agriculture recommends cooking ground pork, that is obtained from pig carcasses, to an internal temperature of 160 °F, followed by a 3-minute rest, and cooking whole cuts to a minimum internal temperature of 145 °F, also followed by a 3-minute rest.",
    "metadata": {
      "cuisine_type": "湘菜（湖南）",
      "dish_name": "猪血丸子",
      "english_name": "Pork blood balls",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/List_of_pork_dishes",
      "timestamp": "2024-11-24T01:21:26.213539"
    }
  },
  {
    "id": "recipe_20241124_012127",
    "content": "Title: Chili sauce and paste\nChinese Name: 剁椒鱼头\nEnglish Name: Chopped chili fish head\nCuisine Type: 湘菜（湖南）\n\nChili sauce and chili paste are condiments prepared with chili peppers. Chili sauce may be hot, sweet or a combination thereof, and may differ from hot sauce in that many sweet or mild varieties exist, which is typically lacking in hot sauces. Several varieties of chili sauce include sugar in their preparation, such as the Thai sweet chili sauce and Filipino agre dulce, which adds sweetness to their flavor profile. Sometimes, chili sauces are prepared with red tomato as primary ingredients. Many chili sauces may have a thicker texture and viscosity than hot sauces. Chili paste usually refers to a product whose main ingredient is chili pepper. Some are used as a cooking ingredient, while others are used to season a dish after preparation. Some are fermented with beans, as in Chinese doubanjiang, and some are prepared with powdered fermented beans, as in Korean gochujang. There are regional varieties of chili paste and also within the same cuisine. Chili sauces and pastes can be used as dipping sauces, cooking glazes and marinades. There are many commercial varieties of mass-produced chili sauce and paste.",
    "metadata": {
      "cuisine_type": "湘菜（湖南）",
      "dish_name": "剁椒鱼头",
      "english_name": "Chopped chili fish head",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Chili_sauce_and_paste",
      "timestamp": "2024-11-24T01:21:27.783549"
    }
  },
  {
    "id": "recipe_20241124_012129",
    "content": "Title: Tea blending and additives\nChinese Name: 桂花糖藕\nEnglish Name: Osmanthus lotus root\nCuisine Type: 上海菜\n\nTea blending is the act of blending different teas (and sometimes other products) to produce a final product that differs in flavor from the original tea used. This occurs chiefly with black tea, which is blended to make most tea bags, but it can also occur with such teas as Pu-erh, where leaves are blended from different regions before being compressed. The most prominent type of tea blending is commercial tea blending, which is used to ensure consistency of a batch on a mass scale so that any variations between different batches and seasons of tea production do not affect the final product. Commercially, it is considered important that any batch of a particular blend must taste the same as the previous batch, so a consumer will not be able to detect a difference in flavor from one purchase to the next. Another common practice is to scent tea leaves or blend tea leaves with herbs, fruits or spices, either for health purposes or to add interesting and more complex aromas and flavor notes. These kinds of teas are usually termed \"scented tea\" (especially when the tea leaves are only scented with certain aromas) or \"flavored teas\" (particularly when additives like flowers, oils, bits of fruit, flavorings, or other herbs are blended in with the tea leaves to be infused together). Another method of flavoring tea leaves is to smoke them in various ways, such as the pinewood smoking used for lapsang souchong. Because tea takes on aromas with ease, there can be problems in the processing, transportation or storage of tea, but this property can also be consciously used to prepare flavored teas. Commercial flavored tea is often flavored in large blending drums with perfumes, flavorings, or essential oils. Although blending and scenting teas can add an additional dimension to tea, the process may also sometimes be used to cover and obscure the quality of sub-standard teas.",
    "metadata": {
      "cuisine_type": "上海菜",
      "dish_name": "桂花糖藕",
      "english_name": "Osmanthus lotus root",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Tea_blending_and_additives",
      "timestamp": "2024-11-24T01:21:29.305538"
    }
  },
  {
    "id": "recipe_20241124_012131",
    "content": "Title: Pang Kok Keong\nChinese Name: 梅菜扣肉\nEnglish Name: Mei cai kou rou\nCuisine Type: 客家菜\n\nPang Kok Keong (born 1975) is a chef in Singapore. He was the chef-owner of Antoinette (closed down circa 2020), a home-grown Parisian-style pâtisserie, restaurant and salon du thé (French for the tea house) that features French cuisine and pastries. The dishes offered are made from a combination of traditional French techniques and modern cooking methods. He is also the owner of \"Sugar Daddy Group\" while Antoinette was running. He now runs his new venture SuperCurry and has a store front for Hakka noodles.",
    "metadata": {
      "cuisine_type": "客家菜",
      "dish_name": "梅菜扣肉",
      "english_name": "Mei cai kou rou",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Pang_Kok_Keong",
      "timestamp": "2024-11-24T01:21:31.015884"
    }
  },
  {
    "id": "recipe_20241124_012132",
    "content": "Title: Beef noodle soup\nChinese Name: 红烧牛肉\nEnglish Name: Red braised beef\nCuisine Type: 云南菜\n\nBeef noodle soup is a noodle soup made of stewed or braised beef, beef broth, vegetables and noodles. It exists in various forms throughout East and Southeast Asia. One of the oldest beef noodle soups is the Lanzhou lamian (蘭州拉麵) or Lanzhou beef noodle soup which was created by the Hui people of northwest China during the Tang dynasty. There are numerous beef noodle soups available in China with a higher variety in the west than the east. Another common variety is the red-braised beef noodle soup (紅燒牛肉麵) from Taiwan, which was first created by Sichuanese Kuomintang veterans; it is commonly known as Taiwanese beef noodle soup in English. Other beef noodle soup varietals include Pho from Vietnam.",
    "metadata": {
      "cuisine_type": "云南菜",
      "dish_name": "红烧牛肉",
      "english_name": "Red braised beef",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Beef_noodle_soup",
      "timestamp": "2024-11-24T01:21:32.568771"
    }
  },
  {
    "id": "recipe_20241124_012134",
    "content": "Title: Lychee pork\nChinese Name: 荔枝肉\nEnglish Name: Lychee pork\nCuisine Type: 闽菜（福建）\n\nLychee pork or lizhi rou (Chinese: 荔枝肉; pinyin: lìzhī ròu; Pe̍h-ōe-jī: lāi-chi-bah; Eastern Min: liĕk-chiĕ-nṳ̆k) is a well known dish in Fujianese cuisine. It consists of small pieces of deep-fried pork and sliced water chestnuts served in a sweet and sour sauce. Its bright red colour is derived from red yeast rice. In unsophisticated establishments, the sauce is commonly made with ketchup, soy sauce and rice vinegar.",
    "metadata": {
      "cuisine_type": "闽菜（福建）",
      "dish_name": "荔枝肉",
      "english_name": "Lychee pork",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Lychee_pork",
      "timestamp": "2024-11-24T01:21:34.091499"
    }
  },
  {
    "id": "recipe_20241124_012135",
    "content": "Title: Gilligan's Island\nChinese Name: 姜母鸭\nEnglish Name: Ginger mother duck\nCuisine Type: 闽菜（福建）\n\nGilligan's Island is an American sitcom created and produced by Sherwood Schwartz. The show's ensemble cast features Bob Denver, Alan Hale Jr., Jim Backus, Natalie Schafer, Tina Louise, Russell Johnson, and Dawn Wells. It aired for three seasons on the CBS network from September 26, 1964, to April 17, 1967. The series follows the comic adventures of seven castaways as they try to survive on an island where they are shipwrecked. Most episodes revolve around the dissimilar castaways' conflicts and their unsuccessful attempts to escape their plight, with the ship's first mate, Gilligan, usually being responsible for the failures. Gilligan's Island ran for 98 episodes. All 36 episodes of the first season were filmed in black and white and were later colorized for syndication. The show's second and third seasons (62 episodes) and the three television film sequels (broadcast between 1978 and 1982) were filmed in color. Gilligan's Island received solid ratings during its original run and grew in popularity during decades of syndication, especially in the 1970s and '80s, when many markets ran the show in the late afternoon.",
    "metadata": {
      "cuisine_type": "闽菜（福建）",
      "dish_name": "姜母鸭",
      "english_name": "Ginger mother duck",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Gilligan%27s_Island",
      "timestamp": "2024-11-24T01:21:35.845903"
    }
  },
  {
    "id": "recipe_20241124_012137",
    "content": "Title: Xiamen\nChinese Name: 同安封肉\nEnglish Name: Tong'an wrapped pork\nCuisine Type: 闽菜（福建）\n\nXiamen, historically romanized as Amoy, is a sub-provincial city in southeastern Fujian, People's Republic of China, beside the Taiwan Strait. It is divided into six districts: Huli, Siming, Jimei, Tong'an, Haicang, and Xiang'an. All together, these cover an area of 1,700.61 square kilometers (656.61 sq mi) with a population of 5,163,970 as of 2020 and estimated at 5.308 million as of 31 December 2022. The urbanized area of the city has spread from its original island to include most parts of all six of its districts, as well as 4 Zhangzhou districts (Xiangcheng, Longwen, Longhai and Changtai), which form a built-up area of 7,284,148 inhabitants. This area also connects with Quanzhou in the north, making up a metropolis of nearly ten million people. The Kinmen Islands (Quemoy) administered by the Republic of China (Taiwan) lie less than 6 kilometers (4 mi) away separated by Xiamen Bay. As part of the Opening Up Policy under Deng Xiaoping, Xiamen became one of China's original four special economic zones opened to foreign investment and trade in the early 1980s. Xiamen Island possessed a major international seaport. The port of Xiamen is a well-developed first-class trunk line port in the Asia-Pacific region. It is ranked the 7th-largest container port in China and ranks 14th in the world. It is the 4th port in China with the capacity to handle 6th-generation large container ships. On 31 August 2010, Xiamen Port incorporated the neighboring port of Zhangzhou to form the largest port of China's Southeast. Ever since the 12th century, Xiamen was also an important origin for many migrants to Singapore, Malaysia, Indonesia and the Philippines. The overseas Chinese used to support Xiamen's educational and cultural institutions. Xiamen is classified as a Large-Port Metropolis. Xiamen is one of the top 40 cities in the world by scientific research as tracked by the Nature Index. The city is home to several major universities, including Xiamen University, one of China's most prestigious universities as a member of the Double First Class Universities, Huaqiao, Jimei, Xiamen University of Technology and Xiamen Medical College.",
    "metadata": {
      "cuisine_type": "闽菜（福建）",
      "dish_name": "同安封肉",
      "english_name": "Tong'an wrapped pork",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Xiamen",
      "timestamp": "2024-11-24T01:21:37.353625"
    }
  },
  {
    "id": "recipe_20241124_012138",
    "content": "Title: White cut chicken\nChinese Name: 白切鸡\nEnglish Name: White cut chicken\nCuisine Type: 上海本帮菜\n\nWhite cut chicken or white sliced chicken (traditional Chinese: 白切雞; simplified Chinese: 白切鸡) is a type of siu mei. Unlike most other meats in the siu mei category, this particular dish is not roasted, but poached. The dish is common to the cultures of Southern China, including Guangdong, Fujian and Hong Kong. In Hawaii, this popular dish is known as cold ginger chicken.",
    "metadata": {
      "cuisine_type": "上海本帮菜",
      "dish_name": "白切鸡",
      "english_name": "White cut chicken",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/White_cut_chicken",
      "timestamp": "2024-11-24T01:21:38.943697"
    }
  },
  {
    "id": "recipe_20241124_012140",
    "content": "Title: West Lake Fish in Vinegar Gravy\nChinese Name: 西湖醋鱼\nEnglish Name: West Lake vinegar fish\nCuisine Type: 浙菜（浙江）\n\nWest Lake Fish in Vinegar Gravy (Chinese: 西湖醋鱼; pinyin: xīhúcùyú), also known as Song Sao Fish (宋嫂鱼; sòngsǎoyú), is a traditional local specialty dish of Hangzhou in Zhejiang. It first originated in Southern Song dynasty. The material of West Lake Fish in Vinegar Gravy usually is the grass carp. After cooking, the chef will pour the smooth sugar and vinegar on the fish, which will cause the pectoral fin to stand up. In this way, the fish is tender and sweet with special crab flavor.",
    "metadata": {
      "cuisine_type": "浙菜（浙江）",
      "dish_name": "西湖醋鱼",
      "english_name": "West Lake vinegar fish",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/West_Lake_Fish_in_Vinegar_Gravy",
      "timestamp": "2024-11-24T01:21:40.683592"
    }
  },
  {
    "id": "recipe_20241124_012142",
    "content": "Title: List of Seoul dishes\nChinese Name: 黄鱼烧年糕\nEnglish Name: Yellow croaker with rice cakes\nCuisine Type: 浙菜（浙江）\n\nThis is a list of typical Seoul dishes found in Korean cuisine.",
    "metadata": {
      "cuisine_type": "浙菜（浙江）",
      "dish_name": "黄鱼烧年糕",
      "english_name": "Yellow croaker with rice cakes",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/List_of_Seoul_dishes",
      "timestamp": "2024-11-24T01:21:42.245088"
    }
  },
  {
    "id": "recipe_20241124_012143",
    "content": "Title: Longjing prawns\nChinese Name: 龙井虾仁\nEnglish Name: Longjing shrimp\nCuisine Type: 浙菜（浙江）\n\nLongjing prawns, also known as shrimp stir-fried with Dragon Well tea, is a specialty of Hangzhou City, Zhejiang Province, produced using the meat of live river prawns coated with egg white and moistened starch, fried in lard at a medium-low temperature for 15 seconds, removed from the oil and drained when jade-white in colour, and then quickly stir-fried over extreme heat with boiling water infused with Longjing tea, tea leaves and Shaoxing wine. This dish consists primarily of white and green colours; the colours are elegant and the flavour is light and fragrant. According to legend it arose when the Qianlong Emperor of the Qing dynasty visited southern China. Hangzhou's famous Louwailou restaurant is a well-known producer of Longjing prawns.",
    "metadata": {
      "cuisine_type": "浙菜（浙江）",
      "dish_name": "龙井虾仁",
      "english_name": "Longjing shrimp",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Longjing_prawns",
      "timestamp": "2024-11-24T01:21:43.758318"
    }
  },
  {
    "id": "recipe_20241124_012145",
    "content": "Title: Yangzhou fried rice\nChinese Name: 扬州炒饭\nEnglish Name: Yangzhou fried rice\nCuisine Type: 浙菜（浙江）\n\nYangzhou fried rice, also known by several other spellings and names, is a popular Chinese wok-fried rice dish. There are many varieties but it most properly describes egg fried rice with mixed vegetables and two forms of protein, typically pork and shrimp with scallions.",
    "metadata": {
      "cuisine_type": "浙菜（浙江）",
      "dish_name": "扬州炒饭",
      "english_name": "Yangzhou fried rice",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Yangzhou_fried_rice",
      "timestamp": "2024-11-24T01:21:45.519786"
    }
  },
  {
    "id": "recipe_20241124_012147",
    "content": "Title: Kung Pao chicken\nChinese Name: 椒麻鸡\nEnglish Name: Chinese Pepper chicken\nCuisine Type: 浙菜（浙江）\n\nKung Pao chicken (Chinese: 宮保雞丁; pinyin: Gōngbǎo jīdīng; Wade–Giles: Kung1-pao3 chi1-ting1; Zhuyin Fuhao: ㄍㄨㄥ ㄅㄠˇ ㄐㄧ ㄉㄧㄥ), also transcribed Gong Bao or Kung Po, is a spicy, stir-fried Chinese dish made with cubes of cooked chicken, peanuts, vegetables and chili peppers, and Sichuan peppercorns. From its origins in Sichuan cuisine, the dish's popularity has spread throughout China, spawning a number of regional variations—some of which are less spicy than the classic version.",
    "metadata": {
      "cuisine_type": "浙菜（浙江）",
      "dish_name": "椒麻鸡",
      "english_name": "Chinese Pepper chicken",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Kung_Pao_chicken",
      "timestamp": "2024-11-24T01:21:47.062673"
    }
  },
  {
    "id": "recipe_20241124_012148",
    "content": "Title: Chili shrimp\nChinese Name: 油爆虾\nEnglish Name: chili shrimp\nCuisine Type: 浙菜（浙江）\n\nChili shrimp (simplified Chinese: 干烧明虾; traditional Chinese: 乾燒明蝦; pinyin: gān shāo míngxiā or simplified Chinese: 明虾; traditional Chinese: 明蝦; pinyin: míngxiā) is a dish of stir-fried shrimp in chili sauce (which may use doubanjiang) in Chinese cuisine. It is a part of both Sichuan and Shanghai cuisines. The Sichuan version has a crisp texture and uses dried chillis, onions, and tomatoes. In Japanese Chinese cuisine, ebi-chiri (Japanese: エビチリ) is derived from Shanghai-style Sichuan cuisine. It consists of stir-fried shrimp in chilli sauce. It has a history in Japan. According to Iron Chef, ebi-chiri was introduced to and popularized in Japan by Chen Kenmin, father of Iron Chef Chinese Chen Kenichi. In Korean Chinese cuisine, chili shrimp is called kkansyo-saeu (Korean: 깐쇼새우), a named consisting of the word kkansyo derived from Chinese gān shāo (乾燒) and saeu meaning \"shrimp\" in Korean, or chilli-saeu (Korean: 칠리새우) with the English-derived word chilli. There is a Singaporean version of chili shrimp derived from the Sichuan version, but it has a moist texture and uses fresh chili peppers. The New York Times stated that the Singapore version \"resembles only slightly the Chinese version.\"",
    "metadata": {
      "cuisine_type": "浙菜（浙江）",
      "dish_name": "油爆虾",
      "english_name": "chili shrimp",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Chili_shrimp",
      "timestamp": "2024-11-24T01:21:48.614416"
    }
  },
  {
    "id": "recipe_20241124_012150",
    "content": "Title: Sweet and sour\nChinese Name: 锅包肉\nEnglish Name: Guo bao rou\nCuisine Type: 东北菜 （黑龙江等地）\n\nSweet and sour is a generic term that encompasses many styles of sauce, cuisine, and cooking methods. It is commonly used in East Asia and Southeast Asia and has been used in England since the Middle Ages. Sweet and sour sauce remains popular in Asian and Western cuisines.",
    "metadata": {
      "cuisine_type": "东北菜 （黑龙江等地）",
      "dish_name": "锅包肉",
      "english_name": "Guo bao rou",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Sweet_and_sour",
      "timestamp": "2024-11-24T01:21:50.389994"
    }
  },
  {
    "id": "recipe_20241124_012151",
    "content": "Title: Liangpi\nChinese Name: 拉皮\nEnglish Name: Liangpi\nCuisine Type: 东北菜 （黑龙江等地）\n\nLiangpi (simplified Chinese: 凉皮; traditional Chinese: 涼皮; pinyin: liángpí; lit. 'cold skin noodles') is a Chinese dish composed of cold noodles made from wheat or rice flour. It is a specialty dish originating from the cuisine of Shaanxi Province, but has now spread throughout China. In northwestern areas of China, it is often called liangpi zi (凉皮子). Although liangpi is served cold, they are served in every season, including winter.",
    "metadata": {
      "cuisine_type": "东北菜 （黑龙江等地）",
      "dish_name": "拉皮",
      "english_name": "Liangpi",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Liangpi",
      "timestamp": "2024-11-24T01:21:51.715404"
    }
  },
  {
    "id": "recipe_20241124_012153",
    "content": "Title: Bloody Romance\nChinese Name: 大碴子粥\nEnglish Name: Da cha zi zhou\nCuisine Type: 东北菜 （黑龙江等地）\n\nBloody Romance (Chinese: 媚者无疆) is a 2018 Chinese television series based on the novel of the same name by Banming Banmei (半明半寐). It airs on Youku on July 24, 2018, which stars Li Yitong and Qu Chuxiao as the leads. The series air internationally in 13 foreign countries via Youku and Dramafever. The series was a commercial success and passed 600 million views online by August 2018. It was praised for its tight plot and high production quality despite a low budget, as well as for featuring a strong female lead.",
    "metadata": {
      "cuisine_type": "东北菜 （黑龙江等地）",
      "dish_name": "大碴子粥",
      "english_name": "Da cha zi zhou",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Bloody_Romance",
      "timestamp": "2024-11-24T01:21:53.242674"
    }
  },
  {
    "id": "recipe_20241124_012154",
    "content": "Title: Khorkhog\nChinese Name: 内蒙烤全羊\nEnglish Name: Khorkhog\nCuisine Type: 内蒙菜 （内蒙古）\n\nKhorkhog (Mongolian: Xopxoг) is a barbecue dish in Mongolian cuisine. Khorkhog is made by cooking pieces of meat inside a container which also contains hot stones and water, and is often also heated from the outside.",
    "metadata": {
      "cuisine_type": "内蒙菜 （内蒙古）",
      "dish_name": "内蒙烤全羊",
      "english_name": "Khorkhog",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Khorkhog",
      "timestamp": "2024-11-24T01:21:54.738574"
    }
  },
  {
    "id": "recipe_20241124_012156",
    "content": "Title: Duck blood and vermicelli soup\nChinese Name: 鸭血粉丝汤\nEnglish Name: Duck blood vermicelli soup\nCuisine Type: 其他\n\nDuck blood and vermicelli soup (Chinese: 鸭血粉丝汤) is a traditional delicacy of Nanjing, capital of Jiangsu province, and is also eaten in other regions of China. A similar dish is eaten in Poland, Belarus, and Lithuania, where it's called czernina.",
    "metadata": {
      "cuisine_type": "其他",
      "dish_name": "鸭血粉丝汤",
      "english_name": "Duck blood vermicelli soup",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Duck_blood_and_vermicelli_soup",
      "timestamp": "2024-11-24T01:21:56.333869"
    }
  },
  {
    "id": "recipe_20241124_012159",
    "content": "Title: Tangyuan (food)\nChinese Name: 酒酿圆子\nEnglish Name: Tangyuan\nCuisine Type: 其他\n\nTangyuan are a traditional Chinese dessert made of glutinous rice shaped into balls that are served in a hot broth or syrup. They come in varying sizes, anything between a marble to a ping-pong ball, and are sometimes stuffed with filling. Tangyuan are traditionally eaten during the Lantern Festival, but because the name is a homophone for reunion (traditional Chinese: 團圓; simplified Chinese: 团圆; pinyin: tuányuán) and symbolizes togetherness and completeness, this dish is also served at weddings, family reunions, Chinese New Year, and the Dōngzhì (winter solstice) festival.",
    "metadata": {
      "cuisine_type": "其他",
      "dish_name": "酒酿圆子",
      "english_name": "Tangyuan",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Tangyuan_(food)",
      "timestamp": "2024-11-24T01:21:59.094640"
    }
  },
  {
    "id": "recipe_20241124_012201",
    "content": "Title: Yong tau foo\nChinese Name: 客家酿豆腐\nEnglish Name: Hakka stuffed tofu\nCuisine Type: 其他\n\nYong tau foo (simplified Chinese: 酿豆腐; traditional Chinese: 釀豆腐; also spelled yong tao foo, yong tau fu, yong tau hu or yong tofu; ก๋วยเตี๋ยวแคะ in Thailand) is a Hakka Chinese dish consisting primarily of tofu filled with ground meat mixture or fish paste. Variations on this dish feature - instead of tofu - vegetables and mushrooms stuffed with ground meat or fish paste. Yong tau foo is eaten in numerous ways, either dry with a sauce or served as a soup dish. It is commonly found in parts of China, Indonesia, Malaysia, Singapore, Thailand, Vietnam, and in cities where there are large Hakka populations.",
    "metadata": {
      "cuisine_type": "其他",
      "dish_name": "客家酿豆腐",
      "english_name": "Hakka stuffed tofu",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Yong_tau_foo",
      "timestamp": "2024-11-24T01:22:01.447577"
    }
  },
  {
    "id": "recipe_20241124_012202",
    "content": "Title: Peking duck\nChinese Name: 北京烤鸭\nEnglish Name: Peking duck\nCuisine Type: 其他\n\nPeking duck is a dish from Beijing that has been prepared since the Imperial era. The meat is characterized by its thin, crispy skin, with authentic versions of the dish serving mostly the skin and little meat, sliced in front of the diners by the cook. Ducks bred especially for the dish are slaughtered after 65 days and seasoned before being roasted in a closed or hung oven. The meat is often eaten with spring onion, cucumber, and sweet bean sauce, with pancakes rolled around the fillings. Sometimes pickled radish is also inside. Crispy aromatic duck is a similar dish to Peking duck and is popular in the United Kingdom.",
    "metadata": {
      "cuisine_type": "其他",
      "dish_name": "北京烤鸭",
      "english_name": "Peking duck",
      "source": "wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Peking_duck",
      "timestamp": "2024-11-24T01:22:02.943174"
    }
  }
]